<h1 align="center">Data Manipulation Use Pandas</h1>

## 1. Introduction
This notebook is a part of series data manipulation and visualisation using Python and its packages. For NumPy guide, please, refer to [numpy_guide.ipynb](numpy_guide.ipynb). This notebook will focus on Pandas, a library for handling and analysing data in Python.

Pandas manages data in a tabular format called `DataFrame`, which is similar to a speadsheet or SQL table. `DataFrame` is two-dimentsional labeled data which contains many one-dimensional labeled data called `Series`. In nature, `DataFrame` is similar to Numpy's 2D array but with column names and row labels. Additionaly, `DataFrame` allow different data types in each column.

This notebook is divided into two sections dedicated to `Series` and `DataFrame`. Each will cover basic operation from creation, indexing and munipulation.

## 2. Series
This is defination from official documentation: *Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. [Link here](https://pandas.pydata.org/docs/user_guide/dsintro.html)*

In [1]:
import pandas as pd
import numpy as np
import time

start = time.time()

# Series can create from numpy array
serie_np = pd.Series(np.arange(10))
print(f'This serie is created from numpy array: \n{serie_np}')

series_dict = pd.Series({'a': 1, 'b': 2, 'c': 3})
print(f'This serie is created from dictionary: \n{series_dict}')

series_scalar = pd.Series(5, index=['a', 'b', 'c', 'd', 'e'])
print(f'This serie is created from scalar: \n{series_scalar}')

This serie is created from numpy array:
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64
This serie is created from dictionary:
a    1
b    2
c    3
dtype: int64
This serie is created from scalar:
a    5
b    5
c    5
d    5
e    5
dtype: int64

When we print a `Series`, it will show two columns, one for index one for value. This feature is not available in Numpy's 1D array. From above example, we can see that if index is not provided, Pandas will generate index as integer starting from 0. If we provide a dictionany as input, the indexes are the dictionary keys while values are the dictionary values. If we provide a scalar value, Pandas will fill `Series` with that value matching the index. This is similar to Numpy's `np.full()` function. To access `Series` attributes, we can use as follow:

In [2]:
print(f'This is series_dict index: {series_dict.index}')
print(f'This is series_dict values: {series_dict.values}')
series_dict

This is series_dict index: Index(['a', 'b', 'c'], dtype='object')
This is series_dict values: [1 2 3]

a    1
b    2
c    3
dtype: int64

In [3]:
# we can name index and values, similar to colummn header
# header for index
series_dict.index.name = 'letters'
# header for values
series_dict.name = 'numbers'
series_dict

letters
a    1
b    2
c    3
Name: numbers, dtype: int64

As we can be seen that, in nature series is similar to Numpy 1D array - not surprising sin Pandas is built on top of Numpy. However, along with values, series also have index and *column's header* for these attributes. This is a key difference between Numpy's 1D array and Pandas' Series.

This way organising data allow to access Series values using dictionary-like syntax, index:value. `Series` can access use label based `.loc[]` or postional based `.iloc[]` indexing. Let's have a look:

In [4]:
series_animals = pd.Series([12, 13, 14, 15], pd.Index(['cat', 'dog', 'bird', 'fish'], name='animal_name'), name='weight')
series_animals

animal_name
cat     12
dog     13
bird    14
fish    15
Name: weight, dtype: int64

In [5]:
# access value of bird
print(f'Weight of bird is: {series_animals.loc["bird"]}') # or series_animals.iloc[2]
print(f'this is slice from dog to fish: \n{series_animals.loc['dog':'fish']}') # or series_animals.iloc[1:3:-1]
print(f'this is fancy indexing: {series_animals.loc[['cat', 'fish']]}') # or s_animals.iloc[[0, -1]]

Weight of bird is: 14
this is slice from dog to fish:
animal_name
dog     13
bird    14
fish    15
Name: weight, dtype: int64
this is fancy indexing: animal_name
cat     12
fish    15
Name: weight, dtype: int64

As can be seen that the indexing is straght forward and easy to understand. If use integer base indexing, it does not include the last index, similar to list slicing. But the last value is included if use label indexing, similar to dictionary slicing.

If we want to find the label/index by its associate value, we can use `idxmax` for return the index of the maxiimum value. `idxmin` for return the index of the minimum value; or can use boolean indexing. Let's have a look:

In [6]:
# return index of the maximum value
print(series_animals.idxmax())

# return index of the minimum value
print(series_animals.idxmin())

# return label of value that equal to 13
print(series_animals[series_animals == 13].index[0]) # use index[0] to get the first value

fish
cat
dog

Arithmetic operations are aligned against the index label. Then sorted by the order of both series.

In [7]:
series_a = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
series_b = pd.Series([5, 6, 7, 8], index=['c', 'e', 'a', 'f'])
series_a + series_b

a    8.0
b    NaN
c    8.0
d    NaN
e    NaN
f    NaN
dtype: float64

## 3. DataFrame
DataFrame is a collection of series with sharing same label/index. It is similar to 2D array in Numpy but with column name and row label/index. Each column is an independent series and can have different type of data such as `object`, `int`, `float`, etc. The row is called axis 0 and column is called axis 1. We can create datafrom in similar way to series or combine serveral series into a dataframe. Let's have a look:

In [8]:
df = pd.DataFrame(
    {
        'name': ['John', 'Alice', 'Bob', 'Eva'],
        'age': [25, 24, 26, 23],
        'height': [175, 168, 180, 160],
        'weight': [70, 55, 80, 45]
    }
)
df

    name  age  height  weight
0   John   25     175      70
1  Alice   24     168      55
2    Bob   26     180      80
3    Eva   23     160      45

In [9]:
# access to index/labels
display(df.index)
# access to columns names/headers
display(df.columns)

RangeIndex(start=0, stop=4, step=1)

Index(['name', 'age', 'height', 'weight'], dtype='object')

There are several way to indexing a `DataFrame`. We can use label based `.loc['label']` or position based `.iloc[]`. The syntax is similar to numpy but plus with label. Let's have a look:

In [10]:
df_1 = pd.DataFrame(
    np.arange(12).reshape(4, 3),
    columns=['A', 'B', 'C'],
    index=['a', 'b', 'c', 'd']
)
display(df_1)

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [11]:
# access all rows and and column A
display(df_1.loc[:, 'A']) # or df_1.iloc[:, 0]
# access row b and all columns
display(df_1.loc['b']) # or df_1.iloc[1]
# access a single value in row b and column A
display(df_1.loc['b', 'A']) # or df_1.iloc[1, 0]

a    0
b    3
c    6
d    9
Name: A, dtype: int64

A    3
B    4
C    5
Name: b, dtype: int64

np.int64(3)

`DataFrame` arithmetic operations are, similar to series, aligned against index and columns. If it is not matching, NaN will return. Let's have a look:

In [12]:
df_2 = pd.DataFrame(
    np.arange(6, 18).reshape(4, 3),
    columns=['A', 'B', 'F'],
    index=['f', 'e', 'a', 'b']
)
display(df_1)
display(df_2)
display(df_1 + df_2)

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

    A   B   F
f   6   7   8
e   9  10  11
a  12  13  14
b  15  16  17

      A     B   C   F
a  12.0  14.0 NaN NaN
b  18.0  20.0 NaN NaN
c   NaN   NaN NaN NaN
d   NaN   NaN NaN NaN
e   NaN   NaN NaN NaN
f   NaN   NaN NaN NaN

### Combine Dataframe
Data combination in Pandas is similar to SQL syntax. The package provides three main types of data combination:
- `pd.merge()`: use when data frame have structured, relational data
- `pd.concat()`: when append data frame along axis
- `pd.join()`: when both dataframe have same index  

This notebook will focus on `pd.concat()` and `pd.merge()`. The `pd.concat()`, by default, just combine dataframe along axis by adding all rows and collumns from both dataframes. if data miss mathced, it will return Missing Value In other words it is outer join. We can use inner join by specify `join='inner`  which all rows and column with missing value will be remove. Let's have a look:

In [13]:
# append df_2 to df_1 along the row axis
display(pd.concat([df_1, df_2], axis=0)) # default join is outer

    A   B     C     F
a   0   1   2.0   NaN
b   3   4   5.0   NaN
c   6   7   8.0   NaN
d   9  10  11.0   NaN
f   6   7   NaN   8.0
e   9  10   NaN  11.0
a  12  13   NaN  14.0
b  15  16   NaN  17.0

In [14]:
# appned df_2 to df_1 along the column axis with inner join
# it behaves like outer join with dropna=True
display(pd.concat([df_1, df_2], axis=0, join='inner'))

    A   B
a   0   1
b   3   4
c   6   7
d   9  10
f   6   7
e   9  10
a  12  13
b  15  16

In [15]:
# merger inner join for df_1 use name_1 and for df_2 use name_2
pd.merge(df_1, df_2, left_on='A', right_on='A', how='inner', suffixes=('_df1', '_df2')) # inner join is default

   A  B_df1   C  B_df2   F
0  6      7   8      7   8
1  9     10  11     10  11

In [16]:
# if we wan to do left outer join, full outer join, right outer, cross join, we can use how=:'left', 'right', 'outer', 'cross' respectively
pd.merge(df_1, df_2, left_on='A', right_on='A', how='left', suffixes=('_df1', '_df2'))

   A  B_df1   C  B_df2     F
0  0      1   2    NaN   NaN
1  3      4   5    NaN   NaN
2  6      7   8    7.0   8.0
3  9     10  11   10.0  11.0

In [17]:
pd.merge(df_1, df_2, left_on='A', right_on='A', how='right', suffixes=('_df1', '_df2'))

    A  B_df1     C  B_df2   F
0   6    7.0   8.0      7   8
1   9   10.0  11.0     10  11
2  12    NaN   NaN     13  14
3  15    NaN   NaN     16  17

As we can see from above example, the difference between `pd.concat()` and `pd.merge()` is that `pd.concat()` just append/stack dataframe along axis the result can be union or intersection of both dataframes. `pd.merge()` is more like SQL join, it can merge dataframes based on common column or index. The result can be inner, outer, left or right join. It is depend on tasks in hands and nature of data, we can decide which method to use.

## 4. Conclusion
This notebook is a personal point of view about one of widely use library in Python for data manipulation and analysis, Pandas. In short, it can be said that Pandas is an numpy with header and index. It can indexing data using label or postional locations. It can perform operation similar to SQL and Numpy. The basic data strucutre is `Series`; the combination of `Series` is `DataFrame`. Mastering Pandas skills will accelerate a lots of tasks in data handling and analysis.

Pandas is powerful tool for data handling and analysis as well as visualisation. I reserve this topic for next notebook. I hope this notebook is helpful for those who are new to Pandas. If you have any question or suggestion, feel free to ask. Thank you for reading.

In [18]:
end = time.time()
print(f'Execution time: {end - start:.2f} s')

Execution time: 0.21 s